print('-----------------------------------------')
print('|      Ваша средняя оценка за год       |')
print('-----------------------------------------')
Rus = int(input('Оценка по Русскому:'))
Math = int(input('Оценка по Математике:'))
Eng = int(input('Оценка по Английскому:'))
Inf = int(input('Оценка по Информатике:'))
print('-----------------------------------------')

if Rus >= 4 and Math >= 4 and Eng >= 4 and Inf >= 4:
    print('|   Вы можете поступить в Университет   |')
    print('-----------------------------------------')
    print('|       Вы можете поступить в ВУЗ       |')
    print('-----------------------------------------')
elif Rus == 3 and Math == 3 and Eng == 3 and Inf == 3:
    print('|       Вы можете поступить в ВУЗ       |')
    print('-----------------------------------------')
elif Rus <= 2 and Math <= 2 and Eng <= 2 and Inf <= 2:
    print('|     Вы никуда не можете поступит      |')
    print('-----------------------------------------')
