import random

print('--------------------------------------------------------')
print('|            pythone games3000megavibrator             |')
print('--------------------------------------------------------')
print('|            Отгадайде число от 1 до 100               |')
print('| Программа отвечает только: 1.больше 2.меньше 3.равно |')
print('--------------------------------------------------------')
a = random.randint(1,100)
while True:
    f = int(input('введите число: '))
    if a == f:
        print('Вы угадали')
        print('------------------')
        break
    if a > f:
        print('больше')
        print('------------------')
    if a < f:
        print('меньше')
        print('------------------')
print()
print()
print('--------------------------------------------------------')
print('|             World of Maxim: work and wife            |')
print('--------------------------------------------------------')
print('|     Выберите сколько дней будет работать Максим      |')
print('--------------------------------------------------------')
days = int(input('введите количество дней: '))
def generate_random_number(x, y):
    return random.randint(x, y)
work = generate_random_number(2, 3)
print('--------------------------------------------------------')
print(f'|  Максим работает {days} дня|')
print(f'|  Его работа длится {days*8} часа|')
print(f'|  Он сделал {work*(8*days)} работ')
print('--------------------------------------------------------')
